#+TITLE: February 28, 2017 - March 11, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                            | CANCELED |
|------+------+-------------+---------+-----------------------------------------------------------------+----------|
|      |      |             |         | READING.1488465959. Linux Device Drivers, 3rd edit (2017-03-11) |          |
|      |      |             |         | KERNEL.1488466221. Try shakthimaan Linux device d (2017-03-11)  |          |
|      |      |             |         | WRITING.1488519486. PyCon Pune 2017 blog post (2017-03-10)      |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Mbuf   |       2.0 |   2.25 |  2.0 |         0 |   2017-03-11 | ########## |
| Mpduty |      12.0 |   15.1 | 12.0 |         0 |   2017-03-11 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph

#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:12]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                      |
|-----+------------+--------+-------+--------------------------------------|
|   1 | 2017-02-28 |   14.0 |    13 |                                      |
|   2 | 2017-03-01 |   14.0 |    12 |                                      |
|   3 | 2017-03-02 |   14.0 |    10 |                                      |
|   4 | 2017-03-03 |   14.0 |     9 |                                      |
|   5 | 2017-03-04 |   14.0 |     8 |                                      |
|   6 | 2017-03-05 |   14.0 |     7 |                                      |
|   7 | 2017-03-06 |   14.0 |     6 |                                      |
|   8 | 2017-03-07 |   14.0 |     5 |                                      |
|   9 | 2017-03-08 |   14.0 |     4 |                                      |
|  10 | 2017-03-09 |   14.0 |     2 |                                      |
|  11 | 2017-03-10 |   12.0 |     1 | WRITING.1488519486                   |
|  12 | 2017-03-11 |    0.0 |     0 | KERNEL.1488466221 READING.1488465959 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                | TASKID             | OWNER  | PRIORITY | TODO | ESTIMATED | ACTUAL |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| * TASKS                                                             |                    |        | B        |      |      14.0 |  17.35 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** READING                                                          |                    |        | B        |      |       8.0 |   12.6 |
| *** Linux Device Drivers, 3rd edition, Part I [6/6]                 | READING.1488465959 | mpduty | B        | DONE |       8.0 |   12.6 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** WRITING                                                          |                    |        | B        |      |       2.0 |   2.25 |
| *** PyCon Pune 2017 blog post                                       | WRITING.1488519486 | mbuf   | B        | DONE |       2.0 |   2.25 |
|---------------------------------------------------------------------+--------------------+--------+----------+------+-----------+--------|
| ** KERNEL                                                           |                    |        | B        |      |       4.0 |    2.5 |
| *** Try shakthimaan Linux device driver code examples, Part I [6/6] | KERNEL.1488466221  | mpduty | B        | DONE |       4.0 |    2.5 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 12
  :SPRINTSTART: <2017-02-28 Tue>
  :wpd-mpduty: 2
  :wpd-mbuf: 1
  :END:
** READING
*** DONE Linux Device Drivers, 3rd edition, Part I [6/6]
    CLOSED: [2017-03-11 Sat 19:45]
    :PROPERTIES:
    :ESTIMATED: 8.0
    :ACTUAL: 12.6
    :OWNER: mpduty
    :ID: READING.1488465959
    :TASKID: READING.1488465959
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-10 Fri 08:15]--[2017-03-10 Fri 09:20] =>  1:05
    CLOCK: [2017-03-09 Thu 21:35]--[2017-03-09 Thu 23:00] =>  1:25
    CLOCK: [2017-03-07 Tue 09:15]--[2017-03-07 Tue 10:30] =>  1:15
    CLOCK: [2017-03-05 Sun 09:30]--[2017-03-05 Sun 10:00] =>  0:30
    CLOCK: [2017-03-05 Sun 07:45]--[2017-03-05 Sun 09:00] =>  1:15
    CLOCK: [2017-03-04 Sat 10:00]--[2017-03-04 Sat 12:30] =>  2:30
    CLOCK: [2017-03-03 Fri 22:15]--[2017-03-03 Fri 23:00] =>  0:45
    CLOCK: [2017-03-02 Thu 20:35]--[2017-03-02 Thu 21:45] =>  1:10
    CLOCK: [2017-03-02 Thu 08:20]--[2017-03-02 Thu 09:00] =>  0:40
    CLOCK: [2017-03-01 Wed 08:40]--[2017-03-01 Wed 10:00] =>  1:20
    CLOCK: [2017-03-01 Wed 08:30]--[2017-03-01 Wed 09:15] =>  0:45
    :END:
    - [X] Preface
    - [X] Chapter 1: An Introduction to Device Drivers
    - [X] Chapter 2: Building and Running Modules
    - [X] Chapter 3: Char Drivers
    - [X] Chapter 4: Debugging Techniques
    - [X] Chapter 5: Concurrency and Race Conditions
** WRITING
*** DONE PyCon Pune 2017 blog post
    CLOSED: [2017-03-10 Fri 07:32]
    :PROPERTIES:
    :ESTIMATED: 2.0
    :ACTUAL: 2.25
    :OWNER: mbuf
    :ID: WRITING.1488519486
    :TASKID: WRITING.1488519486
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-10 Fri 06:55]--[2017-03-10 Fri 07:30] =>  0:35
    CLOCK: [2017-03-09 Thu 23:00]--[2017-03-10 Fri 00:30] =>  1:30
    CLOCK: [2017-03-05 Sun 17:30]--[2017-03-05 Sun 18:10] =>  0:40
    :END:

    http://shakthimaan.com/posts/2017/03/10/pycon-pune-2017/news.html
** KERNEL
*** DONE Try shakthimaan Linux device driver code examples, Part I [6/6]
    CLOSED: [2017-03-11 Sat 22:56]
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL: 2.5
    :OWNER: mpduty
    :ID: KERNEL.1488466221
    :TASKID: KERNEL.1488466221
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-06 Mon 21:00]--[2017-03-06 Mon 23:30] =>  2:30
    :END:
    - [X] Example 1
    - [X] Example 2
    - [X] Example 3
    - [X] Example 4
    - [X] Example 5
    - [X] Example 6
